{
    "document": {
        "url": "http://www.officeopenxml.com/WPdocument.php",
        "desc": "The <w:document> element is the root element of the main content part.The <w:document> element can contain the elements below.<w:document> has a single attribute:",
        "attrs": {
            "conformance": {
                "desc": "Specifies the conformance class to which the document conforms. Possible values are:",
                "desc_cn": "指定文档符合的一致性类。可能的值是:\n"
            }
        },
        "elems": {
            "background": {
                "desc": "Specifies the background for every page of the document. The background can be either an DrawingML object or a sold color. If it is a DrawingML \n    object, then the background element contains a drawing element. If a solid color \n    is used, then background is an empty element, with the color specified in the following attributes.",
                "attrs": {
                    "color": {
                        "desc": "Specifies the color. Possible values are either hex-encoded RGB values (in RRGGBB format) or auto. E.g.,\n                <w:background w:color=\"2C34FF\"/> ",
                        "desc_cn": "指定的颜色。可能的值是hex编码的RGB值(在RRGGBB格式)或auto。例如,\n< w:背景w:颜色= \" 2 c34ff \" / >\n"
                    },
                    "themeColor": {
                        "desc": "Specifies the base theme color (which is specified in the Theme part). E.g.,\n                <w:background w:themeColor=\"accent5\"/> ",
                        "desc_cn": "指定基本主题颜色(在主题部分中指定)。例如,\n< w w:背景:themeColor = \" accent5 \" / >\n"
                    },
                    "themeShade": {
                        "desc": "Specifies the shade value applied to the theme color (in hex encoding of values 0-255). E.g.,\n                <w:background w:themeColor=\"accent2\" w:themeShade=\"BF\"/> ",
                        "desc_cn": "指定应用于主题颜色的阴影值(在hex编码中0 - 255)。例如,\n< w w:背景:themeColor = \" accent2”w:themeShade = \"男朋友\" / >\n"
                    },
                    "themeTint": {
                        "desc": "Specifies the tint value applied to the theme color (in hex encoding of values 0-255). E.g.,\n                <w:background w:themeColor=\"accent2\" w:themeTint=\"99\"/> ",
                        "desc_cn": "指定应用于主题颜色的tint值(在hex编码中0 - 255)。例如,\n< w w:背景:themeColor = \" accent2”w:themeTint = \" 99 \" / >\n"
                    }
                },
                "desc_cn": "为文档的每一页指定背景。背景可以是DrawingML对象，也可以是出售的颜色。如果它是一个DrawingML\n对象，然后背景元素包含一个绘图元素。如果一个纯色\n使用后，背景是一个空元素，其颜色在以下属性中指定。\n"
            },
            "body": {
                "desc": "Specifies the contents of the body of the document. It has no attributes. It can contain a number of elements, most related to tracking \n    changes and adding customer XML. The core elements are listed below.",
                "elems": {
                    "p": {
                        "desc": "The paragraph is the main block-level container for content within an ooxml document. (Tables can also contain content at the same level as a paragraph.) \n    The paragraph is specified with <w:p> element. The paragraph can contain rich formatting properties for the\n    paragraph (contained within a <w:pPr>). The text within the paragraph is further contained within one or more runs (<w:r>).  Paragraphs may also contain bookmarks, hyperlinks, fields, comments, etc.The <w:p> element can contain a number of elements, mostly related to tracking revisions and adding custom XML.  The core elements are shown below.",
                        "url": "http://www.officeopenxml.com/WPparagraph.php",
                        "elems": {
                            "bookmarkStart": {
                                "desc": "Links are specified with the <w:hyperlink> element. Links to locations external to the document and links to locations within the document are handled differently based upon the presence or not of the r:id attribute. If the link is to an external target, then the r:id attribute is specified, which is the ID of a relationship stored in the relationship part (document.xml.rels). That relationship has a value of External for the TargetMode attribute. A specific location within the target for the link can be specified with the docLocation attribute.  See attributes below.The r:id=\"rId4\" references the following relationship within the relationships part for the document (document.xml.rels).An internal link is specified by including the anchor attribute with the value of a bookmark within the document. The most commonly used attributes are:",
                                "url": "http://www.officeopenxml.com/WPhyperlink.php",
                                "attrs": {
                                    "id": {
                                        "desc": "Specifies a unique identifier for the bookmark. The value must match the value of the corresponding id for the bookmarkStart element.",
                                        "desc_cn": "指定书签的唯一标识符。该值必须匹配bookmarkStart元素对应的id的值。\n"
                                    },
                                    "name": {
                                        "desc": "Specifies the bookmark name. The value of this attribute should match the value of the anchor attribute for the hyperlink element.",
                                        "desc_cn": "指定书签名称。这个属性的值应该与超链接元素的锚属性值相匹配。\n"
                                    },
                                    "colFirst": {
                                        "desc": "This attribute is used to define a bookmark that is within a table. If it appears, so must the colLast attribute. It is possible for a bookmark within a table to only cover cells within a certain column and row range by specifying the first row that is part of the bookmark, the first column of each row that is part of the bookmark, the last column that is part of the bookmark, and the last row that is part of the bookmark. The first row is specified by placing the beginning bookmark (bookmarkStart) in the first cell of the row. The last row is specified by placing the ending bookmark (bookmarkEnd) at the end of the row.  The first column is specified with this attribute. And the last column is specified with the colLast, shown below. The attribute is a zero-based index of the columns, so the first column is represented by w:colFirst=\"0\".For example, a table of three rows and three columns might have a bookmark applied to the first two cells in the first two rows. The bookmark indicated by blue shading above would be specified with the following:",
                                        "desc_cn": "这个属性用于定义一个表内的书签。如果出现了，那么colLast属性也必须如此。书签有可能在一个表只覆盖细胞某一列和行范围内通过指定是书签的一部分的第一行,每一行的第一列是书签的一部分,最后一列是书签的一部分,和最后一行的书签。第一行是通过在第一个单元格中放置开始书签(bookmarkStart)来指定的。最后一行是通过在行的末尾放置结束书签(bookmarkEnd)来指定的。第一个列是用这个属性指定的。最后一列是用colLast指定的，如下所示。该属性是列的零值索引，因此第一列由w表示:colFirst=“0”。例如，一个由三行和三列组成的表可能有一个书签应用于前两行的前两个单元格。上面用蓝色阴影表示的书签可以用下面的内容来说明:\n"
                                    },
                                    "colLast": {
                                        "desc": "Specifies the zero-based index of the last column in the row which is part of the bookmark.  If this attribute appears, so must the colFirst attribute. See the colFirst discussion, above.",
                                        "desc_cn": "指定行中最后一列的零值索引，这是书签的一部分。如果该属性出现，那么colFirst属性也必须如此。参见上面的第一个讨论。\n"
                                    }
                                },
                                "desc_cn": "链接被指定为:元素的作用。指向文档外部位置的链接和文档内的链接的链接是根据存在与否而不是r:id属性来处理的。如果链接是外部目标，那么就指定了r:id属性，这是关系部分中存储的关系的id(document.xml.坏人)。该关系具有TargetMode属性的外部值。链接目标中的特定位置可以使用docLocation属性指定。请参阅下面的属性。r:id=\"rId4\"引用文档中关系部分中的下列关系(document.xml.坏人)。通过将锚属性包含在文档内的书签值来指定一个内部链接。最常用的属性是:\n"
                            },
                            "bookmarkEnd": {
                                "desc": "Specifies the end of a bookmark within a document.  See Bookmarks.",
                                "desc_cn": "指定文档内书签的结尾。看到书签。\n"
                            },
                            "r": {
                                "desc": "Line breaks, carriage returns, tabs, special characters and other special content may appear as elements within\n    text runs (<w:r> </w:r>) rather than within text elements (<t> </t>). ",
                                "url": "http://www.officeopenxml.com/WPtextSpecialContent.php",
                                "elems": {
                                    "br": {
                                        "desc": "Specifies a break.  See Text - Special Content.",
                                        "desc_cn": "指定一个休息。参见文本——特殊内容。\n"
                                    },
                                    "cr": {
                                        "desc": "Specifies a carriage return.  See Text - Special Content.",
                                        "desc_cn": "指定一个回车。参见文本——特殊内容。\n"
                                    },
                                    "drawing": {},
                                    "noBreakHyphen": {
                                        "desc": "Specifies a non-breaking hyphen character.  See Text - Special Content.",
                                        "desc_cn": "指定一个非破坏的连字符。参见文本——特殊内容。\n"
                                    },
                                    "rPr": {
                                        "desc": "Character styles apply to the contents of one or more runs of text. They have a type attribute value of character. They are referenced by the <w:rStyle> element within a run's properties element (<w:rPr>).  The above character style is then applied in content as shown below.There is only one element.Below is a style definition for text that might appear in an external stylesheet.The style is then applied as shown below.",
                                        "url": "http://www.officeopenxml.com/WPstyleCharStyles.php",
                                        "elems": {
                                            "rPr": {
                                                "desc": "Run formatting is specified with elements within the <w:rPr> element.  Some of the most commonly used formatting elements are below.  Other text formatting, such as spacing, shading, and borders, is covered in separate pages.",
                                                "url": "http://www.officeopenxml.com/WPtextFormatting.php",
                                                "elems": {
                                                    "b": {},
                                                    "i": {},
                                                    "caps": {},
                                                    "color": {
                                                        "desc": "Possible attributes are themeColor, themeShade,\n        themeTint, and val.The val attribute specifies the color as a hex value in RRGGBB format, or auto may be specified to allow the consuming\n        software to determine the color.",
                                                        "desc_cn": "可能的属性是themeColor,themeShade，\nval属性将颜色指定为RRGGBB格式的hex值，也可以指定auto允许消费\n软件决定颜色。\n"
                                                    },
                                                    "dstrike": {},
                                                    "emboss": {
                                                        "desc": " Note: The above example specifies emboss,\n        but also sets the color to white: <w:emboss/><w:color w:val=\"FFFFFF\"/>.\n        That seems to be necessary else the result looks like imprint.",
                                                        "desc_cn": "注意:上面的示例指定emboss，\n但也将颜色设置为白色:< w:emboss/><w:color w:val=\"FFFFFF\"/ >。\n这似乎是必要的，结果看起来像印记。\n"
                                                    },
                                                    "imprint": {},
                                                    "outline": {
                                                        "desc": "Specifies that the content should be displayed as if it had an outline.  A one-pixel border is drawn around the inside and outside borders of each character.\n    <outline w:val=\"true\"/>.\n    This is a toggle property.",
                                                        "desc_cn": "指定内容应该像有大纲一样显示。每个字符的内部和外部边界都有一个像素的边框。\nw:<轮廓val = \" true \" / >。\n这是一个开关属性。\n"
                                                    },
                                                    "rStyle": {},
                                                    "shadow": {},
                                                    "smallCaps": {},
                                                    "strike": {},
                                                    "sz": {
                                                        "desc": "The single attribute val specifies a measurement in half-points (1/144 of an inch).  ",
                                                        "desc_cn": "单一属性val指定了半点(1/144英寸)的度量。\n"
                                                    },
                                                    "u": {
                                                        "desc": "The most common attributes are below (the theme-related attributed are omitted):",
                                                        "desc_cn": "下面是最常见的属性(与主题相关的属性被省略):\n"
                                                    },
                                                    "vanish": {},
                                                    "vertAlign": {
                                                        "desc": "The single attribute is val. Permitted values are: ",
                                                        "desc_cn": "单个属性为val，允许值为:\n"
                                                    }
                                                },
                                                "desc_cn": "运行格式化指定了< w:rPr >元素中的元素。下面是一些最常用的格式化元素。其他文本格式，例如间距、阴影和边框，都被单独的页面覆盖。\n"
                                            }
                                        },
                                        "desc_cn": "字符样式应用于一个或多个文本的内容。它们具有字符的类型属性值。它们由< w:rStyle >元素在运行的属性元素中引用(< w:rPr >)。以上的字符样式应用于内容如下所示。只有一个元素。下面是可能出现在外部样式表中的文本的样式定义。然后应用样式如下所示。\n"
                                    },
                                    "softHyphen": {
                                        "desc": "Specifies a soft hyphen character.  See Text - Special Content.",
                                        "desc_cn": "指定一个软连字符。参见文本——特殊内容。\n"
                                    },
                                    "sym": {
                                        "desc": "Symbols are specified with the w:sym element within the w:r element.\n    A symbol is a special character that does not use any of the run fonts specified in rFonts\n        or in the style hierarchy. The character is determined by pulling the hexadecimal value specified in the char attribute from the\n        font specified in the font attribute.Symbols may be referenced in HTML as character entities using short names (e.g., &copy;).  See the W3 recommendation regarding character references.\n    Symbols may also be referenced\n    with numeric character references in the form &#number (decimal form) or\n    &#xnumber (hexadecimal form). See the W3 recommendation.\n    Only Unicode characters are officially supported in HTML and only those should be used, as not all \nbrowsers will have fonts such as Wingdings.  However, fonts may be specified in CSS and numeric character references made to the desired character in the desired font.",
                                        "url": "http://www.officeopenxml.com/http://www.w3.org/TR/html4/sgml/entities.php",
                                        "attrs": {
                                            "char": {},
                                            "font": {}
                                        },
                                        "desc_cn": "符号由w:r元素内的sym元素指定。\n一个符号是一个特殊字符，它不使用在r字体中指定的任何运行字体\n或者在样式层次结构中。这个字符通过将char属性中指定的十六进制值从\n在字体属性中指定的字体。在HTML中，符号可以作为使用短名称的字符实体引用(例如:是)。参见关于字符引用的W3建议。\n符号也可以被引用\n用数字字符引用的形式& #号(小数形式)或\n& # xnumber(十六进制形式)。看到W3的建议。\n只有在HTML中才正式支持Unicode字符，而且只有这些字符才应该被使用\n浏览器将会有像Wingdings这样的字体。然而，在CSS和数字字符引用中，字体可以在所需的字体中指定。\n"
                                    },
                                    "t": {
                                        "desc": "Specifies literal text which will be displayed in the run. Most all text within a document is contained within t elements, except text within a field code. There is one possible attribute (xml:space) within the XML namespace that can be used to specify how space within the t element is to be handled.  Possible values are preserve and default. If whitespace within a run needs to be preserved, it is important that this attribute be set to preserve.  See the XML 1.0 specification at § 2.10.",
                                        "desc_cn": "指定将在运行中显示的文字文本。文档中的大部分文本都包含在t元素中，除了字段代码中的文本之外。在xml命名空间中有一个可能的属性(xml:space)，可以用来指定如何处理t元素内的空间。可能的值是保留的和默认的。如果运行中的空格需要保留，那么将该属性设置为保存是很重要的。看到XML 1.0规范§2.10。\n"
                                    },
                                    "tab": {
                                        "desc": "Specifies a tab character.  See Text - Special Content.",
                                        "desc_cn": "指定一个制表符。参见文本——特殊内容。\n"
                                    }
                                },
                                "desc_cn": "换行、回车、标签、特殊字符和其他特殊内容可以作为元素出现\n文本运行(< w:r> </w:r >)而不是文本元素(< t> </t >)。\n"
                            },
                            "pPr": {
                                "desc": "Paragraph properties are specified in <pPr>.  Each property is a child element of <pPr>. When appearing within a paragraph (w:p) element rather than within a style element (w:style), they are direct formatting and are applied after style/numbering/table properties. \n    Compare with paragraph styles.The most commonly used properties are shown below:",
                                "url": "http://www.officeopenxml.com/WPparagraphProperties.php",
                                "elems": {
                                    "framePr": {},
                                    "ind": {},
                                    "jc": {},
                                    "keepLines": {},
                                    "keepNext": {},
                                    "numPr": {
                                        "desc": "Numbering or leveling refers to ways of labeling individual paragraphs with numbers, letters, and/or symbols, such as might be used in an outline format or with a simple group of bulleted items.  Numbering in OOXML wordprocessing is implemented by first defining a set of rules for how a particular number scheme is to work.  For example, a traditional outline format might look something like this:I. This is the first levelA. This is the second level1. This is the third level.These set of rules which will be used in the document is defined using the <w:abstractNum> element within the root numbering element of the numbering part (numbering.xml).  This set of definitions is \"abstract,\" however, and is not directly referenced in the document.  Instead, instances of the abstract numbering definition are created using <w:num> elements, also within the numbering part.  Those instances may follow the abstract definition exactly or may define overrides or exceptions to the abstract definition.  Finally, those instances are referenced in the document content.  Below is an abstract numbering definition, followed by an instance of that definition.  Both appear within the numbering part.The above XML defines a leveling scheme with just one level (w:lvl w:ilvl=\"0\").  It also creates an instance numbered 1 (w:num w:NumId=\"1\") referencing the abstractNum without any changes or exceptions.  Within the document content this instance may be referenced for a given paragraph, such as shown in the example below.Note that the numbering reference within the document content in the sample above contains a direct reference to the level to be applied because the <w:numPr> contains both the reference to the numbering definition (numId) and a reference to the level (ilvl). \n    See Paragraph Properties for more on <w:numPr>. The other possible way to reference a level in content is through the referenced paragraph style.  That is, in the <w:abstractNum> the appropriate subsidiary level (lvl) could contain a pStyle with a value of ListParagraph.  In that case, the content contains only a reference to the numbering definition instance (numId), but it also references the paragraph style.  The same style will be found in the numbering definition referenced and that level will be used for the paragraph.The Numbering Definitions part has a root element <w:numbering>. See ECMA-376, 3rd Edition (June, 2011), Fundamentals and Markup Language Reference § 11.3.11.  The part contains the definition of each set of numbering rules used in the document, even if a particular level of a given set of rules is not actually used in the document. Note that a package can contain no more than two Numbering Definitions parts--one for the main document and one for the glossary.The child elements of <w:numbering> are below (omitting numIdMacAtLeanup used in tracking changes).",
                                        "url": "http://www.officeopenxml.com/WPnumbering.php",
                                        "elems": {
                                            "numId": {},
                                            "ilvl": {
                                                "desc": "Specifies the numbering level of the numbering definition to use for the paragraph.  It corresponds to the <w:lvl w:ilvl=\"0\"> element within <w:abstractNum> element of the numbering part.Note: When numbering is done with direct formatting (i.e., the pPr is not within a style), then both the numbering definition instance and level within the instance are specified by including both a numId and an ilvl.  When numbering is done as part of a style, only the numId is specified.  The level of the numbering definition to be applied is indicated in the numbering definition with a reference to the paragraph style. See the example below.",
                                                "desc_cn": "指定用于该段的编号定义的编号级别。它对应于< w:lvl w:ilvl=\"0\" >元素< w:abstractNum >元素的编号部分。注意:当编号用直接格式化完成时(即。，pPr不是在一个样式内，那么，实例中的编号定义实例和级别都是通过包含numId和ilvl来指定的。当编号作为样式的一部分完成时，只有numId被指定。要应用的编号定义的级别在编号定义中表示，引用的是段落样式。看下面的例子。\n"
                                            }
                                        },
                                        "desc_cn": "编号或找平是指用数字、字母和/或符号标记单个段落的方法，例如可以用大纲格式或简单的一组项目符号来使用。在OOXML文字处理中，首先定义一组规则，以确定特定的数字方案是如何工作的。例如，传统的大纲格式可能是这样的:I。这是第一级。这是第二级。这是第三层。将在文档中使用的这些规则集使用< w:abstractNum >元素在编号部分的根编号元素(number. xml)中定义。但是，这组定义是“抽象的”，但是在文档中并没有直接引用。相反，抽象编号定义的实例使用< w:num >元素，也在编号部分中创建。这些实例可以精确地遵循抽象定义，也可以定义抽象定义的重写或异常。最后，这些实例在文档内容中被引用。下面是一个抽象的编号定义，后面是这个定义的一个实例。两者都出现在编号部分。上面的XML定义了一个只有一个级别的调平方案(w:lvl w:ilvl=\"0 \")。它还创建了一个编号为1的实例(w:num w:NumId=\"1 \")，引用abstractNum而没有任何更改或异常。在文档内容中，可以为给定段落引用这个实例，如下面的示例所示。请注意，上面示例中的文档内容中的编号引用包含了一个直接引用的级别，因为< w:numPr >包含了对编号定义(numId)的引用和对level(ilvl)的引用。\n请参阅< w:numPr >的段落属性。另一种引用内容级别的方法是通过引用的段落样式。也就是说，在< w:abstractNum >中，适当的辅助级别(lvl)可以包含一个具有list段值的pStyle。在这种情况下，内容只包含对编号定义实例(numId)的引用，但它也引用了段落样式。相同的样式将在引用的编号定义中找到，并且该级别将被用于段落。编号定义部分有一个根元素< w:编号>。看到ecma - 376,第3版(2011年6月),基本面和标记语言参考§11.3.11。该部分包含文档中使用的每一组编号规则的定义，即使在文档中没有实际使用给定一组规则的特定级别。注意，一个包可以包含不超过两个编号定义部分——一个用于主文档，一个用于术语表。< w:编号>的子元素如下(在跟踪更改时省略了numIdMacAtLeanup)。\n"
                                    },
                                    "outlineLvl": {},
                                    "pBdr": {},
                                    "pStyle": {},
                                    "rPr": {},
                                    "sectPr": {},
                                    "shd": {},
                                    "spacing": {},
                                    "tabs": {},
                                    "textAlignment": {}
                                },
                                "desc_cn": "段落属性在< pPr >中指定。每个属性都是< pPr >的子元素。当在一个段落(w:p)元素中出现，而不是在样式元素(w:style)中出现时，它们是直接格式化，并应用于样式/编号/表属性之后。\n与段落样式。最常用的属性如下所示:\n"
                            },
                            "fldSimple": {},
                            "hyperlink": {}
                        },
                        "desc_cn": "该段落是ooxml文档中内容的主要块级容器。(表也可以包含与段落相同级别的内容)。\n该段落由< w:p >元素指定。该段可以包含丰富的格式化属性\n段(包含在< w:pPr >中)。段落内的文本进一步包含在一个或多个运行中(< w:r >)。段落还可以包含书签、超链接、字段、注释等。< w:p >元素可以包含很多元素，主要是跟踪修订和添加定制XML。核心元素如下所示。\n"
                    },
                    "sectPr": {
                        "desc": "OOXML does not define pages--only paragraphs and text. However, it does enable the storing of certain information important to page composition, \n    such as page size, page orientation, borders and margins.  It does this through the use of the section. A section is a grouping of paragraphs that have a\n    specific set of properties used to define the pages on which the text will appear. A section's properties are stored in a sectPr element.  For all sections except the last section, the sectPr \n    element is stored as a child element of the last paragraph in the section. For the last section, the sectPr is stored as a child element of \nthe body element. The following sample shows two sections--the first in portrait orientation and the second in landscape.",
                        "url": "http://www.officeopenxml.com/WPsection.php",
                        "elems": {
                            "cols": {
                                "desc": "A section can be divided into columns with the <w:cols> element. Note: If the columns are of equal width, then the columns are specified with\nattributes of <w:cols>.  If the columns are not equal, then each column is specified as a child <w:col>\nelement, as shown below.",
                                "url": "http://www.officeopenxml.com/WPsectionCols.php",
                                "attrs": {
                                    "equalWidth": {},
                                    "num": {
                                        "desc": " Note: Microsoft Word 2007 seems to require the attribute be set even when the columns are\n        not of equal width.",
                                        "desc_cn": "注意:Microsoft Word 2007似乎需要在列的时候设置属性\n不平等的宽度。\n"
                                    },
                                    "sep": {},
                                    "space": {}
                                },
                                "elems": {
                                    "col": {}
                                },
                                "desc_cn": "可以将一个部分划分为包含< w:cols >元素的列。注意:如果列的宽度相等，则指定列\n< w:关口>的属性。如果列不相等，则每个列都指定为一个child <w:col>\n元素,如下所示。\n"
                            },
                            "footerReference": {
                                "desc": "The footer for a section is specified with the <w:footerReference> element.\n    The footer is referenced via the id attribute. Below is a sample reference to a footer for a section.These references point to relationships in document.xml.rels, which in turn point to the footers via the target element.For each section there can be up to three types of footers: first page footer, odd page footer (default), and even page footer.  The type is specified via the\n    type attribute. If any of the above three types of footers is omitted, then the following rules apply.",
                                "url": "http://www.officeopenxml.com/WPsectionFooterReference.php",
                                "attrs": {
                                    "id": {
                                        "desc": "Specifies the relationship ID to the appropriate footer part.",
                                        "desc_cn": "将关系ID指定到适当的页脚部分。\n"
                                    },
                                    "type": {
                                        "desc": "Specifies the type of footer.  Possible values are:",
                                        "desc_cn": "指定页脚的类型。可能的值是:\n"
                                    }
                                },
                                "desc_cn": "一个部分的页脚是用< w:footerReference >元素指定的。\n页脚是通过id属性引用的。下面是对一个章节的页脚的示例引用。这些引用指向document . xml中的关系。通过目标元素指向页脚。对于每个部分，可以有三种类型的页脚:第一页脚，奇数页脚(默认)，甚至页脚。类型是通过该类型指定的\n类型属性。如果遗漏了以上三种类型的页脚，则应用以下规则。\n"
                            },
                            "formProt": {
                                "desc": "Specifies that the content of the section cannot be edited by a user except for text contained in a form field. Note that enforcement is determined by the\n    documentProtection element within the settings part.",
                                "desc_cn": "指定部分的内容不能由用户编辑，除非在表单字段中包含文本。注意，执行是由\n在设置部分中的documentProtection元素。\n"
                            },
                            "headerReference": {
                                "desc": "The header for a section is specified with the <w:headerReference> element.  \n    The header is referenced via the id attribute. Below is a sample reference to a header for a section.These references point to relationships in the document.xml.rels, which in turn point to the headers:For each section there can be up to three types of headers: first page header, odd page header, and even page header.  The type is specified via the\n    type attribute. If any of the above three types of headers is omitted, then the following rules apply.",
                                "url": "http://www.officeopenxml.com/WPsectionHeaderReference.php",
                                "attrs": {
                                    "id": {
                                        "desc": "Specifies the relationship ID to the appropriate header part.",
                                        "desc_cn": "将关系ID指定到适当的头部分。\n"
                                    },
                                    "type": {
                                        "desc": "Specifies the type of header.  Possible values are:",
                                        "desc_cn": "指定头的类型。可能的值是:\n"
                                    }
                                },
                                "desc_cn": "一个部分的标题是用元素的作用来指定的。\nheader是通过id属性引用的。下面是对一个部分的标题的示例引用。这些引用指向了document.xml中的关系。然后，它又指向了标题:每一节都可以有三种类型的标题:第一页头，奇怪的页头，甚至是页头。类型是通过\n类型属性。如果忽略上述三种类型的头中的任何一种，那么下面的规则就适用了。\n"
                            },
                            "lnNumType": {
                                "desc": "Line numbers are specified for each column of text in a section with the <w:lnNumType> element.",
                                "url": "http://www.officeopenxml.com/WPsectionLineNumering.php",
                                "attrs": {
                                    "countBy": {},
                                    "distance": {},
                                    "restart": {},
                                    "start": {}
                                },
                                "desc_cn": "在带有< w:lnNumType >元素的部分中，为每一列文本指定行号。\n"
                            },
                            "paperSrc": {
                                "desc": "Specifies printer-specific settings for the printer trays to be used for the first and later pages.  E.g.,\n        <w:paperSrc w:first=\"1\" w:other=\"1\"/>. There are two attributes:",
                                "desc_cn": "指定打印机托盘的特定于打印机的设置，以便在第一个和以后的页面使用。例如,\n< w:paperSrc w:首先= \" 1 \" w:其他= \" 1 \" / >。有两个属性:\n"
                            },
                            "pgBorders": {
                                "desc": "Borders for each page of a section are defined with the <w:pgBorders> element.\n    Child elements of this element specify the kinds of border--left, right,\n    bottom, and top.The most commonly used attributes are below (theme-related attributes are omitted):",
                                "url": "http://www.officeopenxml.com/WPsectionBorders.php",
                                "attrs": {
                                    "display": {
                                        "desc": "Specifies on which pages to display the border. Possible values are:",
                                        "desc_cn": "指定要显示边界的页面。可能的值是:\n"
                                    },
                                    "offsetFrom": {
                                        "desc": "Specifies how the relative positioning of the borders should be calculated.  Possible values are:",
                                        "desc_cn": "指定边界的相对位置应如何计算。可能的值是:\n"
                                    },
                                    "zOrder": {
                                        "desc": "Specifies whether the page border is positioned above or below intersecting text and objects. Possible values are:",
                                        "desc_cn": "指定页边框是否位于交叉文本和对象的上面或下面。可能的值是:\n"
                                    },
                                    "color": {},
                                    "id": {
                                        "desc": "Used to define a customer border image.  It specifies the relationship ID for the relationship that contains the border image.\n    The image is contained within a separate part of the package. E.g., <w:bottom w:val=\"custom\" r:id=\"rIdCustomBottomBorder\" . . ./>. The\n    relationship with ID of rIdCustomBottomBorder must contain the image.  Note that the relationship targeted by the attribute must be of type\n    http://purl.oclc.org/ooxml/officeDocument/relationships/image or the document will be non-conformant.Note: Earlier versions of the standard did not support this attribute.",
                                        "desc_cn": "用于定义客户边界图像。它指定了包含边界图像的关系的关系ID。\n该映像包含在包的一个单独部分中。如。w:底部w:“自定义”r:id=“里德海关底边”。那\n与ridcustom边框的ID的关系必须包含图像。注意，属性所针对的关系必须是类型的\nhttp://purl.oclc.org/ooxml/officeDocument/relationships/image或文档将不符合。注意:标准的早期版本不支持这个属性。\n"
                                    },
                                    "shadow": {},
                                    "space": {},
                                    "sz": {},
                                    "val": {
                                        "desc": "Specifies the style of the border.  Page borders can be line borders or art borders.  Possible line border values are:For the possible art borders, see the specification at ECMA-376, 3rd Edition (June, 2011), Fundamentals and Markup Language Reference § 17.18.2.",
                                        "desc_cn": "指定边界的样式。页面边框可以是线边框或艺术边框。可能的行边界值是:对于可能的艺术边界，在ecma-376，第三版(2011年6月)，基础和标记语言参考17.18.2。\n"
                                    }
                                },
                                "elems": {
                                    "top": {},
                                    "bottom": {},
                                    "left": {},
                                    "right": {}
                                },
                                "desc_cn": "每个页面的每个页面的边界都是用元素的作用来定义的。\n这个元素的子元素指定了边界的类型——左，右，\n底部和顶部。下面是最常用的属性(省略了与主题相关的属性):\n"
                            },
                            "pgMar": {
                                "desc": "The margins for each page of a section are defined with the <w:pgMar> element.",
                                "url": "http://www.officeopenxml.com/WPsectionPgMar.php",
                                "attrs": {
                                    "bottom": {
                                        "desc": "Specifies the distance (in twips or twentieths of a point) between the bottom of the text margin and the bottom of the page. The text is placed at the greater of the value\n    of this attribute and the extent of the footer text.  A negative value indicates that the content should be measured from the bottom of the page regardless of the footer,\n    and so will overlap the footer. For example, <w:pgMar w:header=\"-720\" w:bottom=\"1440\" .../> means that the\n    footer must start one inch from the bottom of the page and the main document text must start a half inch from the bottom of the page. In this case, the text and footer overlap\n    since bottom is negative.",
                                        "desc_cn": "指定文本边界底部和页面底部之间的距离(在twips或20秒内)。文本被放置在更大的值上\n这个属性和页脚文本的范围。一个负值表示，内容应该从页面底部来度量，而不考虑页脚，\n和页脚重叠。例如，< w:pgMar w:header=\"-720\" w:bottom=\"1440 \"…/ >意味着\n页脚必须从页面底部开始一英寸，主文档文本必须从页面底部开始半英寸。在本例中，文本和页脚重叠\n从底部是负的。\n"
                                    },
                                    "footer": {
                                        "desc": "Specifies the distance (in twips or twentieths of a point) from the bottom edge of the page to the bottom edge of the footer. ",
                                        "desc_cn": "指定从页面底部边缘到页脚底部边缘的距离(在twips或二十分之一点)。\n"
                                    },
                                    "gutter": {
                                        "desc": "Specifies the page gutter (the extra space added to the margin, typically to account for binding). ",
                                        "desc_cn": "指定页gutter(额外的空间添加到页边，通常用来解释绑定)。\n"
                                    },
                                    "header": {
                                        "desc": "Specifies the distance (in twips or twentieths of a point) from the top edge of the page to the top edge of the header. ",
                                        "desc_cn": "指定从页面顶部边缘到头部顶部边缘的距离(在twips或二十分之一点)。\n"
                                    },
                                    "left": {
                                        "desc": "Specifies the distance (in twips or twentieths of a point) from the left edge of the page to the left edge of the text. ",
                                        "desc_cn": "指定从页面的左边缘到文本的左边缘的距离(在twips或20点上)。\n"
                                    },
                                    "right": {
                                        "desc": "Specifies the distance (in twips or twentieths of a point) from the right edge of the page to the right edge of the text. ",
                                        "desc_cn": "指定从页面的右边缘到文本的右边缘的距离(在twips或二十分之一点)。\n"
                                    },
                                    "top": {
                                        "desc": "Specifies the distance (in twips or twentieths of a point) from the top edge of the page to the top edge of the text. The text is placed at the greater of the value of\n    this attribute and the extent of the header text. A negative value indicates that the contents of the document text should be measured from the top of the page regardless\n    of the header, and will overlap the header text.",
                                        "desc_cn": "指定从页面的顶部边缘到文本顶部边缘的距离(在twips或二十分之一点)。文本被放置在更大的值上\n这个属性和标题文本的范围。负值表示文档文本的内容应该从页面的顶部来度量\n在头文件中，并将会重叠标题文本。\n"
                                    }
                                },
                                "desc_cn": "每个页面的页边距定义为< w:pgMar >元素。\n"
                            },
                            "pgNumType": {
                                "desc": "The page numbers for pages in the section are defined with the <w:pgNumType> element.",
                                "url": "http://www.officeopenxml.com/WPSectionPgNumType.php",
                                "attrs": {
                                    "chapSep": {
                                        "desc": "Specifies the separator character to be used between the chapter and page number if a chapter style has been set.  Possible values are:",
                                        "desc_cn": "如果已经设置了章节样式，则指定在章节和页码之间使用的分隔符。可能的值是:\n"
                                    },
                                    "chapStyle": {
                                        "desc": "Specifies the one-based index of the heading style applied to chapter titles. The nearest heading of the style is located and the numbering information is\n        extracted for the page number. For example, a chapStyle value of 1 (Heading 1 style) means that\n    the numbering value of the nearest Heading 1 style is used for the chapter value in the page number.",
                                        "desc_cn": "指定应用于章节标题的标题样式的单一索引。最接近的样式是位置，编号信息是\n提取的页码。例如，1(标题1样式)的chapStyle值意味着\n最近的标题1样式的编号值用于页码中的章节值。\n"
                                    },
                                    "fmt": {
                                        "desc": "Specifies the number format to be used for page numbers in the section.  The most commonly used values are:",
                                        "desc_cn": "指定在section中用于页码的数字格式。最常用的值是:\n"
                                    },
                                    "start": {
                                        "desc": "Specifies the page number that appears on the first page of the section.  If the value is omitted, numbering continues from the highest page number in the previous section. ",
                                        "desc_cn": "指定出现在该段的第一页的页码。如果省略了该值，那么编号将从上一节中最高的页数继续。\n"
                                    }
                                },
                                "desc_cn": "section中页面的页数定义为< w:pgNumType >元素。\n"
                            },
                            "pgSz": {
                                "desc": "Specifies the properties (size and orientation) for all pages in the section. E.g., <w:pgSz w:h=\"12240\" w:w=\"15840\" w:orient=\"landscape\"/>.\n        The important attributes are below.",
                                "attrs": {
                                    "h": {
                                        "desc": "Specifies the page height in twentieths of a point.",
                                        "desc_cn": "指定一个点的20的页面高度。\n"
                                    },
                                    "w": {
                                        "desc": "Specifies the page width in twentieths of a point.",
                                        "desc_cn": "指定一个点的四分之一的页面宽度。\n"
                                    },
                                    "orient": {
                                        "desc": "Specifies the page orientation. Possible values are landscape and portrait.",
                                        "desc_cn": "指定页面方向。可能的值是风景和肖像。\n"
                                    }
                                },
                                "desc_cn": "指定该部分的所有页面的属性(大小和方向)。如。,< w:pgSz w:h = \" 12240 \" w:w = \" 15840 \" w:东方= \"风景\" / >。\n下面是重要的属性。\n"
                            },
                            "titlePg": {
                                "desc": "Specifies whether the section should have a different header and footer for its first page. If the element is set to true\n        (e.g., <w:titlePg/>), then the section will use a first page header;\n        if it is false (e.g., <w:titlePg w:val=\"false\"/>) (the default value), then the first page uses the odd page header.\n        If the element is set to true but the first page header type is omitted, then a blank header is created.  ",
                                "desc_cn": "指定该部分是否应该在其第一个页面中有不同的页眉和页脚。如果元素设置为true\n(如。，< w:titlePg/ >)，然后将使用第一个页面标题;\n如果它是假的。，< w:titlePg w:val=\"false\"/ >)(默认值)，然后第一个页面使用奇数页头。\n如果元素设置为true，但第一个页头类型被省略，则创建一个空白标题。\n"
                            },
                            "type": {
                                "desc": "Specifies the section type. It determines how the contents of the section will be placed relative to the previous section. E.g.,\n        <w:type w:val=\"nextPage\"/> There are five different types, corresponding to\n        the five possible values of the val attribute.",
                                "desc_cn": "指定了部分类型。它决定了该部分的内容将如何与上一节相比。例如,\nw:w:val =“nextPage”/ >有五种不同的类型\nval属性的五个可能值。\n"
                            },
                            "vAlign": {
                                "desc": "Specifies the vertical alignment for text in the section, relative to the top and bottom margins. E.g., <w:vAlign w:val=\"center\"/>.\n    There is a single attribute val with the following possible values:Below is an example of <w:vAlign w:val=\"both\"/>.",
                                "desc_cn": "指定段落中文本的垂直对齐，相对于顶部和底部的边缘。如。,< w:vAlign w:val = \"中心\" / >。\n有一个属性val，具有下列可能值:下面是一个< w:vAlign w:val=\"both\"/ >的示例。\n"
                            }
                        },
                        "desc_cn": "OOXML没有定义页面——只有段落和文本。然而，它确实能够存储某些重要的信息到页面组成，\n例如页面大小、页面定位、边框和边距。它通过使用section来实现这一点。section是有A的段落的分组\n用于定义文本出现的页面的特定属性集。section的属性存储在sectPr元素中。对于所有的部分，除了最后一部分，sectPr\n元素被存储为该部分最后一段的子元素。在最后一节中，sectPr作为子元素存储\n身体的元素。下面的示例展示了两个部分——第一个是纵向的，第二个部分是横向的。\n"
                    },
                    "tbl": {
                        "desc": "A table consists of rows and cells and is structured much like an HTML table.  It is defined with the <w:tbl> element. Note: When two adjacent tables having the same style are present together without any intervening <w:p> elements, the tables are treated as a single table.The <w:tbl> element can contain a whole host of elements, mostly related to tracking revisions and adding custom XML.  The core elements are shown below.",
                        "url": "http://www.officeopenxml.com/WPtable.php",
                        "elems": {
                            "tblGrid": {},
                            "tblPr": {},
                            "tr": {}
                        },
                        "desc_cn": "一个表由行和单元组成，结构非常类似于HTML表。它的定义是:元素的作用。注意:当两个相邻的表具有相同的样式时，没有任何干预的元素，表就被当作一个表来处理。元素可以包含大量的元素，这些元素主要与跟踪修订和添加自定义XML有关。核心元素如下所示。\n"
                    }
                },
                "desc_cn": "指定文档主体的内容。它没有属性。它可以包含许多元素，大多数与跟踪有关\n更改并添加客户XML。核心元素如下所示。\n"
            }
        },
        "desc_cn": "元素是主要内容部分的根元素。元素可以包含下面的元素。文档有一个单一的属性:\n"
    }
}